STOCK_LIST = {
    # [에너지 / 전력 설비]
    "플러그 파워": "PLUG", "AES": "AES", "파워 솔루션스 인터내셔널": "PSIX", 
    "트윈디스크": "TWIN", "아이디얼 파워": "IPWR", "에버지": "EVRG", 
    "바이코": "VICR", "에베루스 컨스트럭션 그룹": "EVEV", "스카이X플랫폼스": "SKYX", 
    "엔벤트 일렉트릭": "NVT",

    # [보안 / 방산 / 인증]
    "센티넬원": "S", "텔로스": "TLS", "젠 디지털": "GEN", 
    "L3해리스": "LHX", "팔로알토 네트웍스": "PANW", "OSI시스템즈": "OSIS", 
    "얼리젼": "ALLE", "베리사인": "VRSN", "넷스카우트 시스템즈": "NTCT", 
    "컴포시큐어": "CMPO",

    # [양자 컴퓨팅]
    "리게티컴퓨팅": "RGTI", "아이온큐": "IONQ",

    # [원자력 / 신재생 / 전통 에너지]
    "오클로": "OKLO", "센트러스 에너지": "LEU", "플루언스 에너지": "FLNC", 
    "퀀텀스케이프": "QS", "에너시스": "ENS", "에너지 퓨얼스": "UUUU", 
    "뉴스케일파워": "SMR", "블룸 에너지": "BE", "넥스트라 에너지": "NEE", 
    "나노 뉴클리어 에너지": "NNE", "퍼스트 에너지": "FE", "라이트브리지": "LTBR", 
    "아메리칸 일렉트릭 파워": "AEP", "셰브론": "CVX", "엑슨 모빌": "XOM", 
    "듀크 에너지": "DUK", "서던": "SO",

    # [원자재 / 광업 / 리튬 / 우라늄]
    "아이반호 일렉트릭": "IE", "시그마 리튬 코퍼레이션": "SGML", "리튬 아메리카스": "LAC", 
    "에로코퍼": "ERO", "센테라 골드": "CGAU", "아비노 실버 앤 골드 마인스": "ASM", 
    "노던 다이너스티 미네랄스": "NAK", "웨스턴 코퍼 앤 골드": "WRN", "노바 미네말스(ADR)": "NVA", 
    "우라늄에너지": "UEC", "트릴로지 메탈스": "TMQ", "옥시덴탈 페트롤리움": "OXY", 
    "타세코 마인스": "TGB", "뉴 퍼시픽 메탈스": "NEWP", "퓨리 골드 마인스": "AUG", 
    "크리티컬 메탈스": "CRML", "리튬 아르헨티나": "LAAC", "라르고": "LGO", 
    "우라늄 로열티": "UROY", "스탠더드 리튬": "SLI", "넥사 리소시스": "NEXA", 
    "데니슨 마인스": "DNN",

    # [가상자산 인프라]
    "아이렌": "IREN", "스트래티지": "MSTR", "비트마인": "BITF", # 비트마인은 보통 Bitfarms로 통용

    # [네트워크 / 통신 / 스토리지]
    "안테릭스": "ATEX", "샌디스크": "SNDK", "웨스턴디지털": "WDC", # 샌디스크는 WD에 인수됨
    "브로드컴": "AVGO", "포티넷": "FTNT", "씨게이트": "STX", 
    "시스코 시스템즈": "CSCO", "코어위브": "PRIVATE",

    # [빅테크 / AI / 클라우드 / 소프트웨어]
    "컨스털레이션 에너지": "CEG", "비스트라에너지": "VST", "마이크론 테크놀로지": "MU", 
    "BWX 테크놀로지스": "BWXT", "보잉": "BA", "테슬라": "TSLA", 
    "에퀴닉스": "EQIX", "퍼펙트": "PERF", "아리스타 네트웍스": "ANET", 
    "퓨어 스토리지": "PSTG", "패스틀리": "FSLY", "네비우스 그룹": "NBIS", 
    "오픈 텍스트": "OTEX", "아마존": "AMZN", "알파벳": "GOOGL", 
    "메타": "META", "팔란티어": "PLTR", "몽고DB": "MDB", 
    "엘라스틱": "ESTC", "피그마": "PRIVATE", "서브 로보틱스": "SERV", 
    "마이크로소프트": "MSFT", "레딧": "RDDT", "데이터독": "DDOG", 
    "레지디오 테크놀로지스": "REZI", "오라클": "ORCL", "ADT": "ADT", "애플": "AAPL",

    # [반도체]
    "셈텍": "SMTC", "알레그로 마이크로시스템즈": "ALGM", "세바": "CEVA", 
    "맥스리니어": "MXL", "코히런트": "COHR", "포엣 테크놀로지스": "POET", 
    "큐니티 일렉트로닉스": "QUBT", "폼팩터": "FORM", "마벨 테크놀로지": "MRVL", 
    "AMD": "AMD", "TSMC": "TSM", "엔비디아": "NVDA", 
    "퀄컴": "QCOM", "인텔": "INTC", "텍사스 인스트루먼츠": "TXN",

    # [기타 금융 / 소비재 / 물류 / 헬스케어]
    "S&P글로벌": "SPGI", "넷플릭스": "NFLX", "뱅크오브아메리카": "BAC", 
    "머크": "MRK", "크라우드스트라이크 홀딩스": "CRWD", "디지털오션 홀딩스": "DOCN", 
    "케이던스 디자인 시스템즈": "CDNS", "웨스코 인터내셔널": "WCC", "엔터지": "ETR", 
    "테라다인": "TER", "CMB테크": "CMBT", "유니버셜 시큐리티 인스트루먼츠": "UUU", 
    "톨브라더스": "TOL", "유나이티드 파셀 서비스": "UPS", "페덱스": "FDX", 
    "아메리칸 익스프레스": "AXP", "비자": "V", "AXIA 에너지아": "AXA", 
    "파월 인더스트리스": "POWL", "이리디움 커뮤니케이션스": "IRDM", "골드만삭스 BDC": "GSBD", 
    "에어리스": "ARIS", "버크셔해서웨이": "BRK.B", "코카콜라": "KO"
}